/*
 * @extends HTMLElement
 * @customElement article-detail
 */

export class ArticleDetail extends HTMLElement {

    connectedCallback() {
        const contentType = this.getAttribute('type') || 'Статья';
        const showToc = contentType !== 'Новость' && this.getAttribute('toc') !== 'false';

        this.render(showToc);
    }

    render(showToc) {

        const gridClass = showToc ? 'article-detail__content-grid' : 'article-detail__content--no-toc';

        const tocHTML = showToc ? `
            <nav class="article-detail__article-toc">
                <div class="article-detail__toc-title">Содержание</div>
                      <ul class="article-detail__toc-list">
                            <li class="article-detail__toc-item">
                                 <a href="#main-title" class="article-detail__toc-link main-title">Построить гараж из ЛСТК — просто и дешево</a>
                            </li>
                            <li class="article-detail__toc-item">
                                  <a href="#sec-1" class="article-detail__toc-link">Построить гараж из ЛСТК доступно каждому</a>
                            </li>
                            <li class="article-detail__toc-item">
                                  <a href="#sec-2" class="article-detail__toc-link">Что такое ЛСТК?</a>
                            </li>
                            <li class="article-detail__toc-item">
                                  <a href="#sec-3" class="article-detail__toc-link">Строительство гаража из ЛСТК</a>
                            </li>
                            <li class="article-detail__toc-item">
                                  <a href="#sec-4" class="article-detail__toc-link">Технология сборки быстровозводимого гаража</a>
                            </li>
                     </ul>
            </nav>
        `
            : ''
        ;

        this.innerHTML = `
            <div class="article-detail">
                <div class="container">
                    <div class="${gridClass}">
                        <div class="article-detail__text">
                            <h1 class="article-detail__title title" id="main-title">Построить гараж из ЛСТК — просто и дешево</h1>
                            <h2 id="sec-1">Построить гараж из ЛСТК доступно каждому</h2>
                            <p>Современный этап развития строительных технологий позволяет в короткие сроки, со значительным
                                снижением финансовых и трудозатрат возводить модульные конструкции любых размеров и назначения.
                                Сборные быстровозводимые здания строятся на основе легких стальных тонкостенных профилей без
                                применения классических строительных материалов: кирпича, цементного раствора, древесины или камня.
                                Построить гараж с помощью ЛСТК основой которых являются оцинкованные холодногнутые профили и
                                профнастил в качестве облицовки вполне по силам даже женщине.
                            </p>
                            <p><img src="/img/articles/article-img-1.jpg" alt="article-pic"/></p>
                            <h2 id="sec-2">Что такое ЛСТК?</h2>
                            <p>ЛСТК — это легкие стальные тонкостенные конструкции, из которых собирается каркас здания. Для
                                производства профилей применяется высоколегированная сталь с антикоррозийным цинковым покрытием 1-2
                                класса с толщиной покрытия в 200-280 г/м2. А дополнительная сквозная перфорация на стенках
                                металлических профилей позволяет значительно снизить теплопроводность готового сооружения, делая его
                                теплым и комфортным. Если требуется в короткие сроки построить гараж, ангар или хозблок —
                                быстровозводимые сооружения на каркасе — это лучший выбор!
                            </p>
                            <p>Основой надежного безопасного каркасного сооружения являются несущие металлические балки с ребрами
                                жесткости. Толщина стенок которых составляет от 0,7 до 3 мм, поэтому конструкция и называется
                                тонкостенной. Профилированные стальные оцинкованные кровельные и стеновые панели крепятся с помощью
                                соединительных элементов: болтов, самонарезающих винтов, заклепок и пневматических монтажных
                                дюбелей.
                            </p>
                            <p><img src="/img/articles/article-img-2.jpg" alt="article-pic"/></p>
                            <p>Стальные профили могут быть различной длины, ширины и конечно сечения, так в большинстве проектов
                                используются профили следующих конфигураций:
                            </p>
                            <p>С-образный стоечный профиль используют для формирования несущих балок и перекрытий, а также
                                вертикальных стоек каркаса.
                            </p>
                            <p>Z-образный предназначен для строительства основного каркаса и может служить в качестве соединительных
                                узлов металлоконструкций или обустройстве скатного кровельного покрытия.
                            </p>
                            <p>П-образный стальной элемент выполняет функцию направляющего, а с перфорацией и усиленными ребрами
                                жесткости от оказывается еще и энергоэффективным.
                            </p>
                            <p>ПШ-образный профиль применяется для кровельных систем и формирования фасадной обшивки каркаса здания
                            </p>
                            <p>E-образный (Сигма) применяют в рамных каркасах как ригели или колонны т.к. он превосходные
                                прочностные характеристики это позволяет применять его в любом сооружении при быстровозводимом
                                строительстве.
                            </p>
                            <p>Вертикальная и горизонтальная обрешетка, и стропильная система жестко зафиксированные между собой,
                                позволяют полностью исключить разрушение ЛСТК конструкций.
                            </p>
                            <p>При этом, если проектом предусматривается применение термопрофилей каркаса, слой утеплителей
                                (пенополистирол + изолон) и приточная вентиляция – то данная технология гарантирует высокую
                                энергоэффективность здания без промерзания и появления конденсата.
                            </p>
                            <p><img src="/img/articles/article-img-3.jpg" alt="article-pic"/></p>
                            <h2 id="sec-3">Строительство гаража из ЛСТК</h2>
                            <p>Строительство гаража актуально как для простых автовладельцев, так и для компаний, занимающихся
                                перевозками вне зависимости от объёма автопарка. Целесообразным вариантом решения проблемы является
                                постройка гаража по высокотехнологичной технологии ЛСТК. Легкая и прочная конструкция даже при
                                небольших финансовых вложениях позволит в короткие сроки максимально быстро построить гараж для
                                хранения и ремонта автотранспортных средств. Готовое здание из оцинкованного металлического профиля
                                может быть холодным или утепленным.
                            </p>
                            <p>Использование при строительстве гаражей из комплекта высокопрочных строительных профилей с
                                жаропрочным вспучивающимся огнезащитным покрытием делает строение практически несгораемым. Это
                                актуально, если данное здание возводится близко к жилому дому или как пристройка к нему. А обшивка и
                                кровля гаража выполнена профилированными листами (профнастил), что делает постройку пожаробезопасной
                                т.к. отсутствуют легковоспламеняющиеся материалы.
                            </p>
                            <p><img src="/img/articles/article-img-4.jpg" alt="article-pic"/></p>
                            <h2 id="sec-4">Технология сборки быстровозводимого гаража</h2>
                            <p>Строительство гаража на каркасной основе из оцинкованного профиля актуально и востребовано во всех
                                регионах России. Типовой проект гаража предполагает определенные размеры и форму. Из легких стальных
                                профилей можно возводить здания разной конфигурации и формы без лимита по длине. Из ЛСТК возводят
                                облегченные корпуса не только гаражей, но и ангаров, промышленных производств, складов, АБК,
                                зернохранилищ и мн. др.
                            </p>
                            <p>Для постройки гаража по технологии ЛСТК разрабатывается специальная проектная документация, в которой
                                учитывается:
                            </p>
                            <ul>
                                <li>характеристики и площадь помещения, предназначенного для хранения и размещения транспортного
                                    средства;
                                </li>
                                <li>все используемые материалы для строительства каркаса здания;</li>
                                <li>количество, вид стальных профилей, а также способы их сборки и крепления;</li>
                                <li>индивидуальные требования заказчика.</li>
                            </ul>
                            <p>Этапы монтажа ЛСТК при холодной компоновке гаража:</p>
                            <ol>
                                <li>Строительство гаража начинается с подготовки почвы.</li>
                                <li>Далее следует закладка фундамента, чаще всего применяется мелкозаглублённый монолитный, также
                                    практикуется ленточный тип, и самый простой вариант – установка готовой бетонной плиты.
                                </li>
                                <li>Крупноузловая сборка отдельных колонн, ферм и панелей каркаса по цифровой маркировке и чертежам
                                    объекта.
                                </li>
                                <li>Монтаж готовых конструкций на фундамент с помощью крепежных изделий, поставляемых в комплекте с
                                    каркасом.
                                </li>
                                <li>Соединение всех узлов и панелей в единое сооружение.</li>
                                <li>Облицовка каркаса профилированными листами. Для максимальной герметичности листы накладывают
                                    внахлест с заливкой герметика в швы.
                                </li>
                                <li>Монтаж дверей, окон, въездных ворот.</li>
                                <li>Установка системы вентиляции, электропроводки и водосточной системы.</li>
                            </ol>
                            <p>При постройке утепленного гаража из легких стальных тонкостенных профилей внутренние части стен и
                                потолка обшиваются теплоизоляционными материалами. Это может быть комбинация рулонной фольгированной
                                теплоизоляции (пенофол) и минерального утеплителя, либо минеральный утеплитель, закрываемый жестким
                                покрытием из ОСБ, фанеры, ДСП или МДФ.
                            </p>
                            <p><img src="/img/articles/article-img-5.jpg" alt="article-pic"/></p>
                        </div>
                        ${tocHTML}
                    </div>
                </div>
            </div>
        `
        ;
    }
}

customElements.define('article-detail', ArticleDetail);